pages/writings.org
#+BEGIN_COMMENT
.. title: Writings
.. slug: writings
.. date: 2020-09-30 21:42:32 UTC+02:00
.. tags:
.. category:
.. link:
.. description:
.. type: text
.. has_math: true
#+END_COMMENT

Here is some material I wrote on maths and coding in Python.

* Math Related

- [[link:/posts/one-cookie/][Throwing a six-sided die to fairly select a winner in a group.]] When we have one prize to hand out and want to select one winner out of six persons, we can use a six sided die to select the winner fairly. This is simple enough, but what to do if we have class of $19$ children and one cookie? Here I develop an algorithm that selects fairly a child in the least number of throws, in expectation, for groups of any size. In passing, I discuss many related ideas of interest.
- [[link:/posts/snells-envelope-house-selling-and-buying/][Applying Snell's envelope to the secretary problem.]] For some inventory control problems I use optimal stopping, and to prove that a certain stopping time, i.e., strategy, is optimal, I can use Snell's envelope. To see how this works I apply it to the classical secretary problem. Now I don't particularly like this name, nor its application to hiring people, so I frame the problem in terms of house selling and buying.




* Code Related

- [[link:/posts/making-an-exercise-and-solution-environment/][Making an Exercise and Solution Enviroment in html]]
