writings/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Writings | Nicky's site</title>
<link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../rss.xml">
<link rel="canonical" href="https://ndvanforeest.github.io/writings/">
<!--[if lt IE 9]><![endif]--><link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css">
<link rel="stylesheet" href="https://cdn.rawgit.com/jpswalsh/academicons/master/css/academicons.min.css">
<meta name="author" content="Nicky van Foreest">
<meta property="og:site_name" content="Nicky's site">
<meta property="og:title" content="Writings">
<meta property="og:url" content="https://ndvanforeest.github.io/writings/">
<meta property="og:description" content="Here is some material I wrote on maths and coding in Python.


Math Related


Throwing a six-sided die to fairly select a winner in a group. When we have one prize to hand out and want to select one w">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-09-30T21:42:32+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../">

            <span id="blog-title">Nicky's site</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../bio/" class="nav-link">Bio</a>
                </li>
<li class="nav-item">
<a href="../books/" class="nav-link">Books</a>
                </li>
<li class="nav-item">
<a href="../archive.html" class="nav-link">Posts</a>
                </li>
<li class="nav-item">
<a href="../presentations/" class="nav-link">Presentations</a>
                </li>
<li class="nav-item">
<a href="../sites/" class="nav-link">Sites</a>
                </li>
<li class="nav-item">
<a href="../tools/" class="nav-link">Tools</a>
                </li>
<li class="nav-item active">
<a href="." class="nav-link">Writings <span class="sr-only">(active)</span></a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Writings</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Here is some material I wrote on maths and coding in Python.
</p>
<div id="outline-container-org4e6dd69" class="outline-2">
<h2 id="org4e6dd69">Math Related</h2>
<div class="outline-text-2" id="text-org4e6dd69">
<ul class="org-ul">
<li>
<a href="/posts/one-cookie/">Throwing a six-sided die to fairly select a winner in a group.</a> When we have one prize to hand out and want to select one winner out of six persons, we can use a six sided die to select the winner fairly. This is simple enough, but what to do if we have class of \(19\) children and one cookie? Here I develop an algorithm that selects fairly a child in the least number of throws, in expectation, for groups of any size. In passing, I discuss many related ideas of interest.</li>
<li>
<a href="/posts/snells-envelope-house-selling-and-buying/">Applying Snell's envelope to the secretary problem.</a> For some inventory control problems I use optimal stopping, and to prove that a certain stopping time, i.e., strategy, is optimal, I can use Snell's envelope. To see how this works I apply it to the classical secretary problem. Now I don't particularly like this name, nor its application to hiring people, so I frame the problem in terms of house selling and buying.</li>
</ul>
</div>
</div>
<div id="outline-container-org267d2c9" class="outline-2">
<h2 id="org267d2c9">Code Related</h2>
<div class="outline-text-2" id="text-org267d2c9">
<ul class="org-ul">
<li><a href="/posts/making-an-exercise-and-solution-environment/">Making an Exercise and Solution Enviroment in html</a></li>
</ul>
</div>
</div>
    </div>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-AMS-MML_HTMLorMML" integrity="sha384-3lJUsx1TJHt7BA4udB5KPnDrlkO8T6J6v/op7ui0BbCjvZ9WqV4Xm6DTP6kQ/iBH" crossorigin="anonymous"></script><script type="text/x-mathjax-config">
MathJax.Hub.Config({
  TeX: {
    Macros: {
      P: ["\\textrm{P}\\left\\{#1\\right\\}", 1],
      E: ["\\textrm{E}\\left\\{#1\\right\\}", 1],
      F: "\\mathcal{F}",
      1: ["\\mathbf{1}\\{#1\\}",1],
      d: ["\\,\\textrm{d}#1", 1],
      Unif: ["\\mathrm{Unif}#1", 1],
    }
  }
});
</script></article><!--End of body content--><footer id="footer"><div class="text-center">
<p>
<span class="fa-stack">
  <a href="https://github.com/ndvanforeest">
    <i class="fa fa-github-square fa-stack-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="http://scholar.google.com/citations?user=IEjX_w4AAAAJ">
     <i class="ai ai-google-scholar-square ai-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="https://orcid.org/0000-0001-5428-1723">
     <i class="ai ai-orcid-square ai-2x"></i>
  </a>
</span>
<span class="fa-stack">
  <a href="mailto:vanforeest@gmail.com">
    <i class="fa fa-square fa-stack-2x"></i>
    <i class="fa fa-envelope fa-inverse fa-stack-1x"></i>
  </a>
</span>
</p>
<p>
  Contents © 2023  Nicky van Foreest
  —
  
  —
  Powered by <a href="https://getnikola.com" rel="nofollow">Nikola</a>
</p>
</div>

            
            
        </footer>
</div>
</div>


        <script src="../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
